<?php
require_once('config.php');
$text = "Дано ціле число N (> 1), а також перший член A і різниця D
аріфметичної прогресії. Сформувати і вивести масив розміру N, що складається
з N перших членів даної прогресії:
A, A + D, A + 2 · D, A + 3 · D, .... Вивести умову задачі, початкові значення та
результуючі.";
$N = 5;
$A = 2;
$D = 3;

$arr = array($A);
for ($i = 1; $i < $N; $i++) {
  $arr[] = $A + $i * $D;
}

$tpl_vars=array(
'text' => $text,
'A' => $A,
'N' => $N,
'D' => $D,
'arr' => $arr,
);
$tpl_file='lab1-7.tmpl';
require_once('tpl_config.php');
?>